# SQL Subqueries - Lab Assignment #2

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database ERD

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="img/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database `data2.sqlite` in the data folder.

In [19]:
# Your code here; import the necessary packages
import sqlite3
import pandas as pd

In [21]:
# Your code here; create the connection
conn = sqlite3.Connection("data/data.sqlite")

### Q.1 Write an Equivalent Query using a Subquery

The following query works using a `JOIN`. Rewrite it so that it uses a subquery instead.

```
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM customers
JOIN orders 
    USING(customerNumber)
WHERE orderDate = '2003-01-31'
;
```

In [47]:
q1 = """
select
customerNumber,
contactLastName,
contactFirstName
from customers
where customers.customerNumber in
    (SELECT orders.customerNumber
from orders
where orders.orderDate = '2003-01-31')
;
"""
pd.read_sql(q1, conn)

   customerNumber contactLastName contactFirstName
0             141          Freyre           Diego

### Q.2 Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [49]:
q2 = """
SELECT 
products.productName as "product_name",
SUM(orderdetails.quantityOrdered) as "total_ordered"
from products
join orderdetails on orderdetails.productCode = products.productCode
group by (products.productCode)
;
"""
pd.read_sql(q1, conn)

   customerNumber contactLastName contactFirstName
0             141          Freyre           Diego

### Q.3 Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

**A quick note on the SQL  `SELECT DISTINCT` statement:**

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [43]:
SELECT products.productName AS "product_name", COUNT(DISTINCT orders.customerNumber) AS "total_customers" 
FROM products
JOIN orderdetails ON orderdetails.productCode = products.productCode
JOIN orders ON orders.orderNumber = orderdetails.orderNumber
GROUP BY products.productName
ORDER BY total_customers DESC

SyntaxError: invalid syntax (1179989326.py, line 1)

### Q.4 Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products That Have Been Ordered by Fewer Than 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
SELECT employees.employeeNumber, 
employees.firstName, 
employees.lastName, 
offices.city, 
employees.officeCode
FROM employees
JOIN offices ON offices.officeCode = employees.officeCode
JOIN customers ON customers.salesRepEmployeeNumber = employees.employeeNumber
JOIN orders ON orders.customerNumber = customers.customerNumber
JOIN orderdetails ON orders.orderNumber = orderdetails.orderNumber
JOIN (SELECT products.productName AS "product_name", COUNT(DISTINCT orders.customerNumber) AS "total_customers" 
FROM products
JOIN orderdetails ON orderdetails.productCode = products.productCode
JOIN orders ON orders.orderNumber = orderdetails.orderNumber
GROUP BY products.productCode
HAVING (total_customers) < 20)
GROUP BY employees.employeeNumber, 
employees.firstName, 
employees.lastName, 
offices.city, 
employees.officeCode

### Q.5 Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Whose Customers Have an Average Credit Limit Over 15K

In [ ]:
SELECT employees.employeeNumber, employees.firstName, employees.lastName, COUNT(DISTINCT customers.customerNumber) AS "Number_of_Customers"
FROM employees
JOIN customers ON customers.salesRepEmployeeNumber
= employees.employeeNumber
GROUP BY employees.employeeNumber, employees.firstName, employees.lastName
HAVING AVG(customers.creditLimit) > 15000

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!